---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.Default
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.Default

Special (reserved) type. It cannot be used as a type when defining a resolution, but can be used as a key to query default
 resolution from FailureMessage or FailureDefinition.